
public class hW_2_6 {

    // Создайте программу, выводящую на экран все четырёхзначные числа последовательности 1000 1003 1006 1009 1012 1015

    public static void main(String[] args) {

        System.out.println("Данный код выводит на экран все четырёхзначные числа последовательности 1000 1003 1006 1009 1012 1015 ....");

        for (int i = 1000; i <= 9999; i += 3) {

            System.out.println(i);

        }

    }

}
